0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform  300;

boundaryField
{

    my-velocity-inlet
    {
        type            fixedValue;
        value           uniform 300;
    }

    my-pressure-outlet
    {
        type            zeroGradient;
    }

    my-wall
    {
        type            zeroGradient;
    }

    "(backPlanes|frontPlanes)"  
    {
        type            empty;
    }
    
    symmetry
    {
        type            symmetry;
    }

    freeSurf
    {
        type            symmetry;
    }
}

// ************************************************************************* //
